org/simulacion/03.org
#+title:Simulación de eventos aleatorios
* Probabilidades y variables aleatorias
** Conceptos básicos de Teoría de Probabilidad

   Experimento aleatorio: al repetirlo bajo las mismas condiciones, el resultado
   (mediciones) varía de manera impredecible.

   - Ej. 1: Tirar una moneda 50 veces y anotar el número de “caras” obtenidos.
   - Ej. 2: Contar el número de vehículos en un estacionamiento los Lunes a las 10AM.
   - Ej. 3: Medir el tiempo entre llamadas telefónicas.
   - Ej. 4: Medir el tiempo entre activaciones (spikes) de una neurona.

   Espacio muestral (S): posibles resultados del experimento aleatorio.
   - Ej. 1: $S = \{0,1,2,\dots,50\}$
   - Ej. 2: $S = \{0,1,2,\dots, Max\}$
   - Ej. 3: $S = 0 < t < T_{max}$
   - Ej. 4: $S = 0 < t < T_{max}$

   Definición axiomática de probabilidad

   $A, B \subset S$

   1. $0 \leq P(A)$
   2. $P(S) = 1$
   3. if $A \cap B = \emptyset$, then $P(A \cup B) = P(A) + P(B)$

** Variables Aleatorias

   | Discretas                            | Continuas                             |
   | Espacio muestral contable            | Espacio muestral no-contable          |
   | S = {x1, x2, \dots}                  |                                       |
   | Distribución de probabilidades p(xi) | Función densidad (pdf) p(x)           |
   | x1 x2 x3 x4                          |                                       |
   | Cálculo de probabilidades: sumando   | Cálculo de probabilidades: Integrando |
   | $P(A) = \sum_{x_i \in A} p(x_i)$     | $P(A) = \int_{A}p(x)dx$               |

   | Bernoulli Random Variable               | Uniform Random Variable                  |
   | S_{X} = \{0,1\}                         | S_{X} = [a,b]                            |
   | p_0 = q = 1-p, p_1 = p, 0 \leq p \leq 1 | f_{X}(x)= \frac{1}{b-a}, a \leq x \leq b |
   |                                         |                                          |

* Generación de números aleatorios

** Generación de números aleatorios

*** Números realmente aleatorios:
    Generados a partir de fuentes físicas:
    - Tirando dados / Utilizando urnas
    - Midiendo ruido en semiconductores

    Datos históricos:
    - Antes de las computadoras, se publicaban libros con secuencias de dígitos
      aleatorios.

    Por ej. 40,000 números en 1927 (Tippett) y 100,000 números en 1939
    (KendalBabington Smith).
    - La computadora Ferranti Mark I (1951) generaba una cadena de 20 bits aleatoria
      usando el ruido de una resistencia eléctrica.

*** Números pseudo-aleatorios:
    No es práctico utilizar mecanismos físicos para generar números por lo que
    se han desarrollado algoritmos determinísticos para generar secuencias de
    números que parezcan aleatorios.

    John Von Neuman algorithm (1946)

    Dada una semilla de N dígitos, elevarlo al cuadrado y extraer los N dígitos
    centrales. Repetir el proceso. Por ejemplo, con N=10:

    5772156649 -> "33317 *792380594* 909201" [label="^2"] "33317 *792380594*
    909201" -> 7923805949 [label="^2"]

    Problema: Degeneración. Si se genera una secuencia de 0s o se repite un
    número.

    Metropolis obtuvo una secuencia de 750,000 números (período) usando N=38
    (1956)


** Propiedades de generadores “buenos”
   - Los números deben tener una distribución correcta, por ejemplo uniforme, y no
     deben estar correlacionados.
   - La secuencia debe tener un período suficientemente largo.
   - La secuencia se tiene que poder reproducir (replicar experimentos).

*** Generación de números aleatorios uniformes [0,1]

    Generamos números enteros Xn en [0,m] y calculamos: Un = Xn/m

** Método Lineal Congruente

   Es de la forma $X_{n+1} = f(X_n)$

   Método Lineal Congruente [Lehmer, 1949] $X_{n+1} = \left(aX_n + c\right) mod
   m, n \geq 0$
   - $0 < m$, the modulus
   - $0 \leq a < m$, the multiplier
   - $0 \leq c < m$, the increment
   - $0 \leq X_0 < m$, the starting value

   Por ejemplo: $m=10,X_0=a=c=7$ $7, 6, 9, 0, 7, 6, 9, 0, \dots$

   Período = 4

   Ejercicio: Demostrar que el caso a=0 no es admisible

   Cómo asegurar que el período sea el máximo posible m?

   Teorema A [Grinberger, 1961; Hull&Dobel, 1962]:

   El algoritmo Lineal Congruente tiene período m si y sólo sí:
   1) c es relativo primo con m (no existe número k ≠ 1 que divida a ambos)
   2) b = a - 1 es un múltiplo de p, para cada primo p dividiendo a m.
   3) b es un múltiplo de 4, si m es un múltiplo de 4

   Caso particular que cumple el teorema: a=2^k+1 m=2^e c=1 2 \leq k < e

   Ejercicio: Demostrar que se cumplen las condiciones del Teorema A para este
   caso

** Ejemplos (buenos y malos)

   IBM’s RANDU (1960’):

   X_{n+1} = (65539 X_n ) mod 231

   MALO: No pasa tests simples de aleatoriedad (ya lo veremos)

   GGL (Lewis-Goodman-Miller, 1969):

   X_{n+1} = (16087X_n ) mod (2^{31}- 1)

   Nota: Remplazó a RANDU en IBM 360. Usado originalmente en Matlab

   VAX’s RAND (1977):

   X_{n+1} = (69069 X_n + 1) mod (2^{32})

   Ejercicio: Demostrar si se cumplen las condiciones del Teorema A para estos
   casos

