simulacion/03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-16 Wed 12:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Simulación de eventos aleatorios</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
<link rel="stylesheet" type="text/css" href="../res/org.css"/>


</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org738a63d">1. Probabilidades y variables aleatorias</a>
<ul>
<li><a href="#org6781e23">1.1. Conceptos básicos de Teoría de Probabilidad</a></li>
<li><a href="#orgba6fc05">1.2. Variables Aleatorias</a></li>
</ul>
</li>
<li><a href="#orgf305207">2. Generación de números aleatorios</a>
<ul>
<li><a href="#orgca7185e">2.1. Generación de números aleatorios</a>
<ul>
<li><a href="#orgbceeea8">2.1.1. Números realmente aleatorios:</a></li>
<li><a href="#orgc07e113">2.1.2. Números pseudo-aleatorios:</a></li>
</ul>
</li>
<li><a href="#org9c8cd6f">2.2. Propiedades de generadores “buenos”</a>
<ul>
<li><a href="#org0773826">2.2.1. Generación de números aleatorios uniformes [0,1]</a></li>
</ul>
</li>
<li><a href="#org420daae">2.3. Método Lineal Congruente</a></li>
<li><a href="#org2e520a0">2.4. Ejemplos (buenos y malos)</a></li>
<li><a href="#orge2226d5">2.5. Otros Métodos</a></li>
<li><a href="#org2639549">2.6. Métodos Avanzados</a></li>
</ul>
</li>
<li><a href="#orgbbff1e7">3. Tests de Aleatoriedad</a>
<ul>
<li><a href="#org51fa3a2">3.1. Test de hipótesis (significancia)</a></li>
<li><a href="#orgd7cd6af">3.2. Caso discreta: Test Estadístico Chi2</a></li>
<li><a href="#orgfba2b2c">3.3. Caso continuo</a></li>
<li><a href="#org2028645">3.4. Tests empíricos: Test Espectral</a></li>
<li><a href="#orgd9ee7e7">3.5. Test Visual (Espectral)</a></li>
<li><a href="#org4f636e7">3.6. Tests empíricos: Otros tests</a></li>
</ul>
</li>
<li><a href="#org5ad266d">4. Material de Lectura</a></li>
</ul>
</div>
</div>
<div id="outline-container-org738a63d" class="outline-2">
<h2 id="org738a63d"><span class="section-number-2">1</span> Probabilidades y variables aleatorias</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6781e23" class="outline-3">
<h3 id="org6781e23"><span class="section-number-3">1.1</span> Conceptos básicos de Teoría de Probabilidad</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Experimento aleatorio: al repetirlo bajo las mismas condiciones, el resultado
(mediciones) varía de manera impredecible.
</p>

<ul class="org-ul">
<li>Ej. 1: Tirar una moneda 50 veces y anotar el número de “caras” obtenidos.</li>
<li>Ej. 2: Contar el número de vehículos en un estacionamiento los Lunes a las 10AM.</li>
<li>Ej. 3: Medir el tiempo entre llamadas telefónicas.</li>
<li>Ej. 4: Medir el tiempo entre activaciones (spikes) de una neurona.</li>
</ul>

<p>
Espacio muestral (S): posibles resultados del experimento aleatorio.
</p>
<ul class="org-ul">
<li>Ej. 1: \(S = \{0,1,2,\dots,50\}\)</li>
<li>Ej. 2: \(S = \{0,1,2,\dots, Max\}\)</li>
<li>Ej. 3: \(S = 0 < t < T_{max}\)</li>
<li>Ej. 4: \(S = 0 < t < T_{max}\)</li>
</ul>

<p>
Definición axiomática de probabilidad
</p>

<p>
\(A, B \subset S\)
</p>

<ol class="org-ol">
<li>\(0 \leq P(A)\)</li>
<li>\(P(S) = 1\)</li>
<li>if \(A \cap B = \emptyset\), then \(P(A \cup B) = P(A) + P(B)\)</li>
</ol>
</div>
</div>

<div id="outline-container-orgba6fc05" class="outline-3">
<h3 id="orgba6fc05"><span class="section-number-3">1.2</span> Variables Aleatorias</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Discretas</td>
<td class="org-left">Continuas</td>
</tr>

<tr>
<td class="org-left">Espacio muestral contable</td>
<td class="org-left">Espacio muestral no-contable</td>
</tr>

<tr>
<td class="org-left">S = {x1, x2, &hellip;}</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Distribución de probabilidades p(xi)</td>
<td class="org-left">Función densidad (pdf) p(x)</td>
</tr>

<tr>
<td class="org-left">x1 x2 x3 x4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Cálculo de probabilidades: sumando</td>
<td class="org-left">Cálculo de probabilidades: Integrando</td>
</tr>

<tr>
<td class="org-left">\(P(A) = \sum_{x_i \in A} p(x_i)\)</td>
<td class="org-left">\(P(A) = \int_{A}p(x)dx\)</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Bernoulli Random Variable</td>
<td class="org-left">Uniform Random Variable</td>
</tr>

<tr>
<td class="org-left">S<sub>X</sub> = \{0,1\}</td>
<td class="org-left">S<sub>X</sub> = [a,b]</td>
</tr>

<tr>
<td class="org-left">p<sub>0</sub> = q = 1-p, p<sub>1</sub> = p, 0 &le; p &le; 1</td>
<td class="org-left">f<sub>X</sub>(x)= \frac{1}{b-a}, a &le; x &le; b</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgf305207" class="outline-2">
<h2 id="orgf305207"><span class="section-number-2">2</span> Generación de números aleatorios</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgca7185e" class="outline-3">
<h3 id="orgca7185e"><span class="section-number-3">2.1</span> Generación de números aleatorios</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgbceeea8" class="outline-4">
<h4 id="orgbceeea8"><span class="section-number-4">2.1.1</span> Números realmente aleatorios:</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Generados a partir de fuentes físicas:
</p>
<ul class="org-ul">
<li>Tirando dados / Utilizando urnas</li>
<li>Midiendo ruido en semiconductores</li>
</ul>

<p>
Datos históricos:
</p>
<ul class="org-ul">
<li>Antes de las computadoras, se publicaban libros con secuencias de dígitos
aleatorios.</li>
</ul>

<p>
Por ej. 40,000 números en 1927 (Tippett) y 100,000 números en 1939
(KendalBabington Smith).
</p>
<ul class="org-ul">
<li>La computadora Ferranti Mark I (1951) generaba una cadena de 20 bits aleatoria
usando el ruido de una resistencia eléctrica.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc07e113" class="outline-4">
<h4 id="orgc07e113"><span class="section-number-4">2.1.2</span> Números pseudo-aleatorios:</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
No es práctico utilizar mecanismos físicos para generar números por lo que
se han desarrollado algoritmos determinísticos para generar secuencias de
números que parezcan aleatorios.
</p>

<p>
John Von Neuman algorithm (1946)
</p>

<p>
Dada una semilla de N dígitos, elevarlo al cuadrado y extraer los N dígitos
centrales. Repetir el proceso. Por ejemplo, con N=10:
</p>

<p>
5772156649 -&gt; "33317 <b>792380594</b> 909201" [label="<sup>2</sup>"] "33317 <b>792380594</b>
909201" -&gt; 7923805949 [label="<sup>2</sup>"]
</p>

<p>
Problema: Degeneración. Si se genera una secuencia de 0s o se repite un
número.
</p>

<p>
Metropolis obtuvo una secuencia de 750,000 números (período) usando N=38
(1956)
</p>
</div>
</div>
</div>


<div id="outline-container-org9c8cd6f" class="outline-3">
<h3 id="org9c8cd6f"><span class="section-number-3">2.2</span> Propiedades de generadores “buenos”</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Los números deben tener una distribución correcta, por ejemplo uniforme, y no
deben estar correlacionados.</li>
<li>La secuencia debe tener un período suficientemente largo.</li>
<li>La secuencia se tiene que poder reproducir (replicar experimentos).</li>
</ul>
</div>

<div id="outline-container-org0773826" class="outline-4">
<h4 id="org0773826"><span class="section-number-4">2.2.1</span> Generación de números aleatorios uniformes [0,1]</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Generamos números enteros Xn en [0,m] y calculamos: Un = Xn/m
</p>
</div>
</div>
</div>

<div id="outline-container-org420daae" class="outline-3">
<h3 id="org420daae"><span class="section-number-3">2.3</span> Método Lineal Congruente</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Es de la forma \(X_{n+1} = f(X_n)\)
</p>

<p>
Método Lineal Congruente [Lehmer, 1949] \(X_{n+1} = \left(aX_n + c\right) mod
   m, n \geq 0\)
</p>
<ul class="org-ul">
<li>\(0 < m\), the modulus</li>
<li>\(0 \leq a < m\), the multiplier</li>
<li>\(0 \leq c < m\), the increment</li>
<li>\(0 \leq X_0 < m\), the starting value</li>
</ul>

<p>
Por ejemplo: \(m=10,X_0=a=c=7\) \(7, 6, 9, 0, 7, 6, 9, 0, \dots\)
</p>

<p>
Período = 4
</p>

<p>
Ejercicio: Demostrar que el caso a=0 no es admisible
</p>

<p>
Cómo asegurar que el período sea el máximo posible m?
</p>

<p>
Teorema A [Grinberger, 1961; Hull&amp;Dobel, 1962]:
</p>

<p>
El algoritmo Lineal Congruente tiene período m si y sólo sí:
</p>
<ol class="org-ol">
<li>c es relativo primo con m (no existe número k ≠ 1 que divida a ambos)</li>
<li>b = a - 1 es un múltiplo de p, para cada primo p dividiendo a m.</li>
<li>b es un múltiplo de 4, si m es un múltiplo de 4</li>
</ol>

<p>
Caso particular que cumple el teorema: a=2<sup>k</sup>+1 m=2<sup>e</sup> c=1 2 &le; k &lt; e
</p>

<p>
Ejercicio: Demostrar que se cumplen las condiciones del Teorema A para este
caso
</p>
</div>
</div>

<div id="outline-container-org2e520a0" class="outline-3">
<h3 id="org2e520a0"><span class="section-number-3">2.4</span> Ejemplos (buenos y malos)</h3>
<div class="outline-text-3" id="text-2-4">
<p>
IBM’s RANDU (1960’):
</p>

<p>
X<sub>n+1</sub> = (65539 X<sub>n</sub> ) mod 231
</p>

<p>
MALO: No pasa tests simples de aleatoriedad (ya lo veremos)
</p>

<p>
GGL (Lewis-Goodman-Miller, 1969):
</p>

<p>
X<sub>n+1</sub> = (16087X<sub>n</sub> ) mod (2<sup>31</sup>- 1)
</p>

<p>
Nota: Remplazó a RANDU en IBM 360. Usado originalmente en Matlab
</p>

<p>
VAX’s RAND (1977):
</p>

<p>
X<sub>n+1</sub> = (69069 X<sub>n</sub> + 1) mod (2<sup>32</sup>)
</p>

<p>
Ejercicio: Demostrar si se cumplen las condiciones del Teorema A para estos
casos
</p>
</div>
</div>
