org/simulacion/03.org
** Otros Métodos

   Cuadrático: X_{n+1} = \left(dX^2_n + aX_n +c \right) mod m

   Caso particular (Coveyou):

   X_{n+1} = X_{n}(X_{n} + 1) mod 2^{e} con X_0 mod 4 = 2

   Considerando varios valores del “pasado”

   Secuencia de Fibonacci: X_{n+1} = (X_{n} + X_{n-1}) mod m

   [Green-Smith-Klem, 1959] X_{n+1} = (X_{n} + X_{n-k}) mod m


   [Mitchell-Moore, 1958] X_{n+1} = (X_{n-24} + X_{n-55}) mod m


   Nota: Considerar varios valores del “pasado” permite obtener secuencias con
   períodos mucho mas largos que m

**   Métodos Avanzados

   Mersenne Twister [Matsumoto&Nishimura, 1998]:

   Método por default en Matlab

   Números primos de Mersenne:

   2^{p}-1 , con p primo

   En este método p = 19937 (período igual a (2^{19937}- 1)!!! )

   2^{10}- 1 = 1, 023

   2^{100}- 1 = 1.2677e + 30

   2^{1000} - 1 = 1.0715e + 301

   2^{19937}-1 \approx 1.0e + 6020

   Nota: El número de átomos en el Universo se estima en un valor entre 1078 y
   1082!!!  Algoritmo: Involucra solo operaciones sobre registros binarios de
   tipo SHIFT, AND, OR y XOR.

* Tests de Aleatoriedad
  - Tests teóricos (de hipótesis)
  - Tests empíricos
** Test de hipótesis (significancia)

   Problema: Supongamos que queremos saber si un conjunto de N números X = {x1,
   x2, \dots x_{N}} responde a una determinada distribución de probabilidades
   pX(x).

   Ejemplo: Se tira un dado 100 veces y se anotan las ocurrencias de cada
   número. Pregunta: Está cargado el dado?

   Hipótesis nula $H_{0}: pi = 1/6, i=1,2,\dots,6$.

   Queremos un criterio estadístico para aceptar o rechazar la hipótesis.

   Hay un costo en rechazar H0 si fuera verdadera y lo podemos cuantificar
   calculando la probabilidad asociada a este error:

   E: espacio muestral (todos los posibles X) Ac

   A <latexit
   sha1_base64="weGK+LMZ9g1IFC1dRNF61/5Mw1c=">AAACM3icbZBNS8MwGMfT+Tbn29Sjl+AQ5mW0IuhFmHoZnia4F1hrSbN0C0vTkqTCqP1OXvwiHgTxoIhXv4PpVkE3Hwj58f8/D8nz9yJGpTLNF6OwsLi0vFJcLa2tb2xulbd32jKMBSYtHLJQdD0kCaOctBRVjHQjQVDgMdLxRpeZ37kjQtKQ36hxRJwADTj1KUZKS275qtkjQoTCgWfQlnHgJrbnJ93UphxmdJ7e4hRGP3Jand7wfuI2Utc8hP2p5pYrZs2cFJwHK4cKyKvplp/sfojjgHCFGZKyZ5mRchIkFMWMpCU7liRCeIQGpKeRo4BIJ5nsnMIDrfShHwp9uIIT9fdEggIpx4GnOwOkhnLWy8T/vF6s/FMnoTyKFeF4+pAfM6hCmAUI+1QQrNhYA8KC6r9CPEQCYaVjLukQrNmV56F9VLPMmnV9XKlf5HEUwR7YB1VggRNQBw3QBC2AwQN4Bm/g3Xg0Xo0P43PaWjDymV3wp4yvb73lqvI=</latexit>

   En nuestro ejemplo pX(X|H0) sería la distribución multinomial.

   A: casos para los cuales aceptamos H0 A^{c}: casos para los cuales rechazamos
   H0

   Nivel de significancia : representa nuestra tolerancia para aceptar
   errores. Diseñamos la partición del espacio muestral de manera que la
   probabilidad del error se encuentre por debajo del nivel de significancia.
   Generalmente se usan valores o .  <latexit
   sha1_base64="JtDqaCSYHdUsArJlViGZOYtHm8o=">AAAB7XicbVDLSgNBEOyNrxhfUY9eBoPgKeyKoMegF48RzAOSJfROJsmY2ZllZlYIS/7BiwdFvPo/3vwbJ8keNLGgoajqprsrSgQ31ve/vcLa+sbmVnG7tLO7t39QPjxqGpVqyhpUCaXbERomuGQNy61g7UQzjCPBWtH4dua3npg2XMkHO0lYGONQ8gGnaJ3U7KJIRtgrV/yqPwdZJUFOKpCj3it/dfuKpjGTlgo0phP4iQ0z1JZTwaalbmpYgnSMQ9ZxVGLMTJjNr52SM6f0yUBpV9KSufp7IsPYmEkcuc4Y7cgsezPxP6+T2sF1mHGZpJZJulg0SAWxisxeJ32uGbVi4ghSzd2thI5QI7UuoJILIVh+eZU0L6qBXw3uLyu1mzyOIpzAKZxDAFdQgzuoQwMoPMIzvMKbp7wX7937WLQWvHzmGP7A+/wBi4GPGA==</latexit>

   <latexit
   sha1_base64="u2s30bk8UnapK+1NXxs0IphSIY4=">AAAB83icbVBNS8NAEJ3Ur1q/qh69LJaCp5KIoBeh6MVjBfsBTSiT7aZdukmW3Y1QQv+GFw+KePXPePPfuG1z0OqDgcd7M8zMC6Xg2rjul1NaW9/Y3CpvV3Z29/YPqodHHZ1mirI2TUWqeiFqJnjC2oYbwXpSMYxDwbrh5Hbudx+Z0jxNHsxUsiDGUcIjTtFYyfdRyDGSa+L59UG15jbcBchf4hWkBgVag+qnP0xpFrPEUIFa9z1XmiBHZTgVbFbxM80k0gmOWN/SBGOmg3xx84zUrTIkUapsJYYs1J8TOcZaT+PQdsZoxnrVm4v/ef3MRFdBzhOZGZbQ5aIoE8SkZB4AGXLFqBFTS5Aqbm8ldIwKqbExVWwI3urLf0nnvOG5De/+ota8KeIowwmcwhl4cAlNuIMWtIGChCd4gVcnc56dN+d92Vpyiplj+AXn4xtFmpCD</latexit>

   <latexit
   sha1_base64="Il2UcSmSsjsl3ZU7D+GoaIYbs9Q=">AAAB83icbVBNS8NAEJ3Ur1q/qh69LJaCp5KIoheh6MVjBfsBTSiT7aZdutmE3Y1QSv+GFw+KePXPePPfuG1z0NYHA4/3ZpiZF6aCa+O6305hbX1jc6u4XdrZ3ds/KB8etXSSKcqaNBGJ6oSomeCSNQ03gnVSxTAOBWuHo7uZ335iSvNEPppxyoIYB5JHnKKxku+jSIdIbsilX+2VK27NnYOsEi8nFcjR6JW//H5Cs5hJQwVq3fXc1AQTVIZTwaYlP9MsRTrCAetaKjFmOpjMb56SqlX6JEqULWnIXP09McFY63Ec2s4YzVAvezPxP6+bmeg6mHCZZoZJulgUZYKYhMwCIH2uGDVibAlSxe2thA5RITU2ppINwVt+eZW0zmueW/MeLir12zyOIpzAKZyBB1dQh3toQBMopPAMr/DmZM6L8+58LFoLTj5zDH/gfP4AS7KQhw==</latexit>





