simulacion/03.html

<div id="outline-container-orge2226d5" class="outline-3">
<h3 id="orge2226d5"><span class="section-number-3">2.5</span> Otros Métodos</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Cuadrático: X<sub>n+1</sub> = \left(dX<sup>2</sup><sub>n</sub> + aX<sub>n</sub> +c \right) mod m
</p>

<p>
Caso particular (Coveyou):
</p>

<p>
X<sub>n+1</sub> = X<sub>n</sub>(X<sub>n</sub> + 1) mod 2<sup>e</sup> con X<sub>0</sub> mod 4 = 2
</p>

<p>
Considerando varios valores del “pasado”
</p>

<p>
Secuencia de Fibonacci: X<sub>n+1</sub> = (X<sub>n</sub> + X<sub>n-1</sub>) mod m
</p>

<p>
[Green-Smith-Klem, 1959] X<sub>n+1</sub> = (X<sub>n</sub> + X<sub>n-k</sub>) mod m
</p>


<p>
[Mitchell-Moore, 1958] X<sub>n+1</sub> = (X<sub>n-24</sub> + X<sub>n-55</sub>) mod m
</p>


<p>
Nota: Considerar varios valores del “pasado” permite obtener secuencias con
períodos mucho mas largos que m
</p>
</div>
</div>

<div id="outline-container-org2639549" class="outline-3">
<h3 id="org2639549"><span class="section-number-3">2.6</span> Métodos Avanzados</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Mersenne Twister [Matsumoto&amp;Nishimura, 1998]:
</p>

<p>
Método por default en Matlab
</p>

<p>
Números primos de Mersenne:
</p>

<p>
2<sup>p</sup>-1 , con p primo
</p>

<p>
En este método p = 19937 (período igual a (2<sup>19937</sup>- 1)!!! )
</p>

<p>
2<sup>10</sup>- 1 = 1, 023
</p>

<p>
2<sup>100</sup>- 1 = 1.2677e + 30
</p>

<p>
2<sup>1000</sup> - 1 = 1.0715e + 301
</p>

<p>
2<sup>19937</sup>-1 &asymp; 1.0e + 6020
</p>

<p>
Nota: El número de átomos en el Universo se estima en un valor entre 1078 y
1082!!!  Algoritmo: Involucra solo operaciones sobre registros binarios de
tipo SHIFT, AND, OR y XOR.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbbff1e7" class="outline-2">
<h2 id="orgbbff1e7"><span class="section-number-2">3</span> Tests de Aleatoriedad</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Tests teóricos (de hipótesis)</li>
<li>Tests empíricos</li>
</ul>
</div>
<div id="outline-container-org51fa3a2" class="outline-3">
<h3 id="org51fa3a2"><span class="section-number-3">3.1</span> Test de hipótesis (significancia)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Problema: Supongamos que queremos saber si un conjunto de N números X = {x1,
x2, &hellip; x<sub>N</sub>} responde a una determinada distribución de probabilidades
pX(x).
</p>

<p>
Ejemplo: Se tira un dado 100 veces y se anotan las ocurrencias de cada
número. Pregunta: Está cargado el dado?
</p>

<p>
Hipótesis nula \(H_{0}: pi = 1/6, i=1,2,\dots,6\).
</p>

<p>
Queremos un criterio estadístico para aceptar o rechazar la hipótesis.
</p>

<p>
Hay un costo en rechazar H0 si fuera verdadera y lo podemos cuantificar
calculando la probabilidad asociada a este error:
</p>

<p>
E: espacio muestral (todos los posibles X) Ac
</p>

<p>
A &lt;latexit
sha1<sub>base64</sub>="weGK+LMZ9g1IFC1dRNF61/5Mw1c="&gt;AAACM3icbZBNS8MwGMfT+Tbn29Sjl+AQ5mW0IuhFmHoZnia4F1hrSbN0C0vTkqTCqP1OXvwiHgTxoIhXv4PpVkE3Hwj58f8/D8nz9yJGpTLNF6OwsLi0vFJcLa2tb2xulbd32jKMBSYtHLJQdD0kCaOctBRVjHQjQVDgMdLxRpeZ37kjQtKQ36hxRJwADTj1KUZKS275qtkjQoTCgWfQlnHgJrbnJ93UphxmdJ7e4hRGP3Jand7wfuI2Utc8hP2p5pYrZs2cFJwHK4cKyKvplp/sfojjgHCFGZKyZ5mRchIkFMWMpCU7liRCeIQGpKeRo4BIJ5nsnMIDrfShHwp9uIIT9fdEggIpx4GnOwOkhnLWy8T/vF6s/FMnoTyKFeF4+pAfM6hCmAUI+1QQrNhYA8KC6r9CPEQCYaVjLukQrNmV56F9VLPMmnV9XKlf5HEUwR7YB1VggRNQBw3QBC2AwQN4Bm/g3Xg0Xo0P43PaWjDymV3wp4yvb73lqvI=&lt;/latexit&gt;
</p>

<p>
En nuestro ejemplo pX(X|H0) sería la distribución multinomial.
</p>

<p>
A: casos para los cuales aceptamos H0 A<sup>c</sup>: casos para los cuales rechazamos
H0
</p>

<p>
Nivel de significancia : representa nuestra tolerancia para aceptar
errores. Diseñamos la partición del espacio muestral de manera que la
probabilidad del error se encuentre por debajo del nivel de significancia.
Generalmente se usan valores o .  &lt;latexit
sha1<sub>base64</sub>="JtDqaCSYHdUsArJlViGZOYtHm8o="&gt;AAAB7XicbVDLSgNBEOyNrxhfUY9eBoPgKeyKoMegF48RzAOSJfROJsmY2ZllZlYIS/7BiwdFvPo/3vwbJ8keNLGgoajqprsrSgQ31ve/vcLa+sbmVnG7tLO7t39QPjxqGpVqyhpUCaXbERomuGQNy61g7UQzjCPBWtH4dua3npg2XMkHO0lYGONQ8gGnaJ3U7KJIRtgrV/yqPwdZJUFOKpCj3it/dfuKpjGTlgo0phP4iQ0z1JZTwaalbmpYgnSMQ9ZxVGLMTJjNr52SM6f0yUBpV9KSufp7IsPYmEkcuc4Y7cgsezPxP6+T2sF1mHGZpJZJulg0SAWxisxeJ32uGbVi4ghSzd2thI5QI7UuoJILIVh+eZU0L6qBXw3uLyu1mzyOIpzAKZxDAFdQgzuoQwMoPMIzvMKbp7wX7937WLQWvHzmGP7A+/wBi4GPGA==&lt;/latexit&gt;
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="u2s30bk8UnapK+1NXxs0IphSIY4="&gt;AAAB83icbVBNS8NAEJ3Ur1q/qh69LJaCp5KIoBeh6MVjBfsBTSiT7aZdukmW3Y1QQv+GFw+KePXPePPfuG1z0OqDgcd7M8zMC6Xg2rjul1NaW9/Y3CpvV3Z29/YPqodHHZ1mirI2TUWqeiFqJnjC2oYbwXpSMYxDwbrh5Hbudx+Z0jxNHsxUsiDGUcIjTtFYyfdRyDGSa+L59UG15jbcBchf4hWkBgVag+qnP0xpFrPEUIFa9z1XmiBHZTgVbFbxM80k0gmOWN/SBGOmg3xx84zUrTIkUapsJYYs1J8TOcZaT+PQdsZoxnrVm4v/ef3MRFdBzhOZGZbQ5aIoE8SkZB4AGXLFqBFTS5Aqbm8ldIwKqbExVWwI3urLf0nnvOG5De/+ota8KeIowwmcwhl4cAlNuIMWtIGChCd4gVcnc56dN+d92Vpyiplj+AXn4xtFmpCD&lt;/latexit&gt;
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="Il2UcSmSsjsl3ZU7D+GoaIYbs9Q="&gt;AAAB83icbVBNS8NAEJ3Ur1q/qh69LJaCp5KIoheh6MVjBfsBTSiT7aZdutmE3Y1QSv+GFw+KePXPePPfuG1z0NYHA4/3ZpiZF6aCa+O6305hbX1jc6u4XdrZ3ds/KB8etXSSKcqaNBGJ6oSomeCSNQ03gnVSxTAOBWuHo7uZ335iSvNEPppxyoIYB5JHnKKxku+jSIdIbsilX+2VK27NnYOsEi8nFcjR6JW//H5Cs5hJQwVq3fXc1AQTVIZTwaYlP9MsRTrCAetaKjFmOpjMb56SqlX6JEqULWnIXP09McFY63Ec2s4YzVAvezPxP6+bmeg6mHCZZoZJulgUZYKYhMwCIH2uGDVibAlSxe2thA5RITU2ppINwVt+eZW0zmueW/MeLir12zyOIpzAKZyBB1dQh3toQBMopPAMr/DmZM6L8+58LFoLTj5zDH/gfP4AS7KQhw==&lt;/latexit&gt;
</p>
</div>
</div>
