simulacion/03.html





<div id="outline-container-orgd7cd6af" class="outline-3">
<h3 id="orgd7cd6af"><span class="section-number-3">3.2</span> Caso discreta: Test Estadístico Chi2</h3>
<div class="outline-text-3" id="text-3-2">
<p>
15
</p>

<p>
Cuando se aplica?  Cuando tenemos una muestra de una variable aleatoria
discreta finita y queremos evaluar si responde a una determinada distribución
de probabilidad teórica.
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="bkCP3I9YJWa0WIq5ymXb46EMsA8="&gt;AAAB6nicbVBNS8NAEJ3Ur1q/qh69LBbBU0lEqMeiF09S0X5AG8pmO2mXbjZhdyOU0J/gxYMiXv1F3vw3btsctPXBwOO9GWbmBYng2rjut1NYW9/Y3Cpul3Z29/YPyodHLR2nimGTxSJWnYBqFFxi03AjsJMopFEgsB2Mb2Z++wmV5rF8NJME/YgOJQ85o8ZKD3d93i9X3Ko7B1klXk4qkKPRL3/1BjFLI5SGCap113MT42dUGc4ETku9VGNC2ZgOsWuppBFqP5ufOiVnVhmQMFa2pCFz9fdERiOtJ1FgOyNqRnrZm4n/ed3UhFd+xmWSGpRssShMBTExmf1NBlwhM2JiCWWK21sJG1FFmbHplGwI3vLLq6R1UfXcqnd/Walf53EU4QRO4Rw8qEEdbqEBTWAwhGd4hTdHOC/Ou/OxaC04+cwx/IHz+QMglI2u&lt;/latexit&gt;
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="ITy9EE2YiceosOIWTBDZM5Bxwh4="&gt;AAAB63icbVA9SwNBEJ2LXzF+RS1tFoNgFe5E0DJoYxnBxEByhL3NJlmyu3fszgnhyF+wsVDE1j9k579xL7lCEx8MPN6bYWZelEhh0fe/vdLa+sbmVnm7srO7t39QPTxq2zg1jLdYLGPTiajlUmjeQoGSdxLDqYokf4wmt7n/+MSNFbF+wGnCQ0VHWgwFo5hLOumLfrXm1/05yCoJClKDAs1+9as3iFmquEYmqbXdwE8wzKhBwSSfVXqp5QllEzriXUc1VdyG2fzWGTlzyoAMY+NKI5mrvycyqqydqsh1Kopju+zl4n9eN8XhdZgJnaTINVssGqaSYEzyx8lAGM5QTh2hzAh3K2FjaihDF0/FhRAsv7xK2hf1wK8H95e1xk0RRxlO4BTOIYAraMAdNKEFDMbwDK/w5invxXv3PhatJa+YOYY/8D5/ACFZjkg=&lt;/latexit&gt;
</p>

<p>
Ejemplo (libro Leon-Garcia): se toman n=114 números al azar de la guía
telefónica y se anotan los últimos dígitos. Queremos saber si la distribución
es uniforme.
</p>

<p>
Método: medimos la dispersión de las ocurrencias observadas ( esperadas ( ):
&lt;latexit
sha1<sub>base64</sub>="bkCP3I9YJWa0WIq5ymXb46EMsA8="&gt;AAAB6nicbVBNS8NAEJ3Ur1q/qh69LBbBU0lEqMeiF09S0X5AG8pmO2mXbjZhdyOU0J/gxYMiXv1F3vw3btsctPXBwOO9GWbmBYng2rjut1NYW9/Y3Cpul3Z29/YPyodHLR2nimGTxSJWnYBqFFxi03AjsJMopFEgsB2Mb2Z++wmV5rF8NJME/YgOJQ85o8ZKD3d93i9X3Ko7B1klXk4qkKPRL3/1BjFLI5SGCap113MT42dUGc4ETku9VGNC2ZgOsWuppBFqP5ufOiVnVhmQMFa2pCFz9fdERiOtJ1FgOyNqRnrZm4n/ed3UhFd+xmWSGpRssShMBTExmf1NBlwhM2JiCWWK21sJG1FFmbHplGwI3vLLq6R1UfXcqnd/Walf53EU4QRO4Rw8qEEdbqEBTWAwhGd4hTdHOC/Ou/OxaC04+cwx/IHz+QMglI2u&lt;/latexit&gt;
</p>

<p>
) respecto de las
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="ITy9EE2YiceosOIWTBDZM5Bxwh4="&gt;AAAB63icbVA9SwNBEJ2LXzF+RS1tFoNgFe5E0DJoYxnBxEByhL3NJlmyu3fszgnhyF+wsVDE1j9k579xL7lCEx8MPN6bYWZelEhh0fe/vdLa+sbmVnm7srO7t39QPTxq2zg1jLdYLGPTiajlUmjeQoGSdxLDqYokf4wmt7n/+MSNFbF+wGnCQ0VHWgwFo5hLOumLfrXm1/05yCoJClKDAs1+9as3iFmquEYmqbXdwE8wzKhBwSSfVXqp5QllEzriXUc1VdyG2fzWGTlzyoAMY+NKI5mrvycyqqydqsh1Kopju+zl4n9eN8XhdZgJnaTINVssGqaSYEzyx8lAGM5QTh2hzAh3K2FjaihDF0/FhRAsv7xK2hf1wK8H95e1xk0RRxlO4BTOIYAraMAdNKEFDMbwDK/w5invxXv3PhatJa+YOYY/8D5/ACFZjkg=&lt;/latexit&gt;
</p>

<p>
Pearson (1900) demostró que D2 responde a una distribución de tipo Chi2, por
lo tanto, encontramos tal que y aceptamos la hipótesis siempre que &lt;latexit
sha1<sub>base64</sub>="fInOqGTCCrWkRGJFOZWK1l6FLBY="&gt;AAAB6HicbVBNS8NAEJ34WetX1aOXYBE8lUQEPRa9eGzBfkAbymY7adduNmF3IpTSX+DFgyJe/Une/Ddu2xy09cHA470ZZuaFqRSGPO/bWVvf2NzaLuwUd/f2Dw5LR8dNk2SaY4MnMtHtkBmUQmGDBElspxpZHEpshaO7md96Qm1Eoh5onGIQs4ESkeCMrFSnXqnsVbw53FXi56QMOWq90le3n/AsRkVcMmM6vpdSMGGaBJc4LXYzgynjIzbAjqWKxWiCyfzQqXtulb4bJdqWIneu/p6YsNiYcRzazpjR0Cx7M/E/r5NRdBNMhEozQsUXi6JMupS4s6/dvtDISY4tYVwLe6vLh0wzTjabog3BX355lTQvK75X8etX5eptHkcBTuEMLsCHa6jCPdSgARwQnuEV3pxH58V5dz4WrWtOPnMCf+B8/gDgKYz4&lt;/latexit&gt;
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="lccRgaShPhZ69tPojm9FdfGGMi8="&gt;AAAB+nicbVBNS8NAEJ34WetXqkcvi0Wol5IUQS9KUQ8eK9gPaGPZbDft0s0m7G6UEvtTvHhQxKu/xJv/xm2bg7Y+GHi8N8PMPD/mTGnH+baWlldW19ZzG/nNre2dXbuw11BRIgmtk4hHsuVjRTkTtK6Z5rQVS4pDn9OmP7ya+M0HKhWLxJ0exdQLcV+wgBGsjdS1C7XS9X3lQh+jc9TBPB7grl10ys4UaJG4GSlChlrX/ur0IpKEVGjCsVJt14m1l2KpGeF0nO8kisaYDHGftg0VOKTKS6enj9GRUXooiKQpodFU/T2R4lCpUeibzhDrgZr3JuJ/XjvRwZmXMhEnmgoyWxQkHOkITXJAPSYp0XxkCCaSmVsRGWCJiTZp5U0I7vzLi6RRKbtO2b09KVYvszhycACHUAIXTqEKN1CDOhB4hGd4hTfryXqx3q2PWeuSlc3swx9Ynz+5QpJb&lt;/latexit&gt;
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="8pSi+1AgvpeGonMtEfe7uG3/L7M="&gt;AAAB7HicbVA9SwNBEJ3zM8avqKXNYhCswl0QtLAIamEZwUsCyRn2NnvJkr29Y3dOCCG/wcZCEVt/kJ3/xk1yhSY+GHi8N8PMvDCVwqDrfjsrq2vrG5uFreL2zu7efungsGGSTDPus0QmuhVSw6VQ3EeBkrdSzWkcSt4MhzdTv/nEtRGJesBRyoOY9pWIBKNoJf/2sXqF3VLZrbgzkGXi5aQMOerd0lenl7As5gqZpMa0PTfFYEw1Cib5pNjJDE8pG9I+b1uqaMxNMJ4dOyGnVumRKNG2FJKZ+ntiTGNjRnFoO2OKA7PoTcX/vHaG0WUwFirNkCs2XxRlkmBCpp+TntCcoRxZQpkW9lbCBlRThjafog3BW3x5mTSqFc+tePfn5dp1HkcBjuEEzsCDC6jBHdTBBwYCnuEV3hzlvDjvzse8dcXJZ47gD5zPHxL8jjA=&lt;/latexit&gt;
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="0Q5hyTvTCK2DBfTwY+CLULcwtTU="&gt;AAACGXicbZDLSsNAFIYn9VbrLerSzWAR6qIlKYJuCkVdCIJUsK3QpGEynbRDJ5MwMxFKyGu48VXcuFDEpa58G6eXhbb+MPDxn3M4c34/ZlQqy/o2ckvLK6tr+fXCxubW9o65u9eSUSIwaeKIReLeR5IwyklTUcXIfSwICn1G2v7wYlxvPxAhacTv1Cgmboj6nAYUI6Utz7Quu1VYg45MQi8d1uysm16X7Qw6gUA4Ld14tMxjjx53q1k6hswzi1bFmggugj2DIpip4ZmfTi/CSUi4wgxJ2bGtWLkpEopiRrKCk0gSIzxEfdLRyFFIpJtOLsvgkXZ6MIiEflzBift7IkWhlKPQ150hUgM5Xxub/9U6iQrO3JTyOFGE4+miIGFQRXAcE+xRQbBiIw0IC6r/CvEA6UyUDrOgQ7DnT16EVrViWxX79qRYP5/FkQcH4BCUgA1OQR1cgQZoAgwewTN4BW/Gk/FivBsf09acMZvZB39kfP0AL32fNA==&lt;/latexit&gt;
</p>

<p>
En el ejemplo (ver resolución en el libro): D2 = 9.51, K = 10. Si usamos un
nivel de significancia del 1%, entonces t = 21.7.  Como D2 &lt; t, entonces
aceptamos la hipótesis diciendo que los datos responden a una distribución
uniforme con un error del 1%.
</p>
</div>
</div>
