org/simulacion/03.org
** Caso continuo

   16

   Opción 1: dividir el espacio en K subintervalos mutuamente exclusivos y
   calcular la probabilidad asociada a cada sub-intervalo (ver Ejemplo 8.36,
   libro Leon-García [15] donde se aplica un test Chi2 con una distribución
   exponencial usando 20 sub-intervalos).

   Opción 2: Test Estadístico Kolmogorov-Smirnov

   Dada n observaciones {x_1, x_2, \dots, x_n} (ordenadas) de una variable
   continua X, obtenemos una aproximación empírica a la función acumulativa:

   <latexit
   sha1_base64="Ycf//4GX99SVzRFpx5jZ3aFVh1U=">AAACGHicbVDLSsNAFJ34rPUVdelmMAh1UxMRdCMUheKygn1AE8JkOmmHTiZhZiItIZ/hxl9x40IRt935N07bLLT1wIXDOfdy7z1BwqhUtv1trKyurW9slrbK2zu7e/vmwWFLxqnApIljFotOgCRhlJOmooqRTiIIigJG2sHwbuq3n4iQNOaPapwQL0J9TkOKkdKSb57XK6MzFyWJiEfQHSCV1XOtwBvohgLhzLXgyKfQZQSO8oznvmnZVXsGuEycgligQMM3J24vxmlEuMIMSdl17ER5GRKKYkbysptKkiA8RH3S1ZSjiEgvmz2Ww1Ot9GAYC11cwZn6eyJDkZTjKNCdEVIDuehNxf+8bqrCay+jPEkV4Xi+KEwZVDGcpgR7VBCs2FgThAXVt0I8QDoQpbMs6xCcxZeXSeui6thV5+HSqt0WcZTAMTgBFeCAK1AD96ABmgCDZ/AK3sGH8WK8GZ/G17x1xShmjsAfGJMfks+e3Q==</latexit>

   Método: medimos la distancia a la distribución real: <latexit
   sha1_base64="vx21Sm94RHFF2TrK9UqcprJU+5M=">AAACBHicbVDLSgMxFM34rPU16rKbYBHqwjIjgm6EolBcVrAPaIchk2ba0CQzJhlpmXbhxl9x40IRt36EO//G9LHQ1gP3cjjnXpJ7gphRpR3n21paXlldW89sZDe3tnd27b39mooSiUkVRyySjQApwqggVU01I41YEsQDRupB73rs1x+IVDQSd3oQE4+jjqAhxUgbybdz9/ASctT3+3DY6iKdlkeF/vFJ2bShb+edojMBXCTujOTBDBXf/mq1I5xwIjRmSKmm68TaS5HUFDMyyrYSRWKEe6hDmoYKxIny0skRI3hklDYMI2lKaDhRf2+kiCs14IGZ5Eh31bw3Fv/zmokOL7yUijjRRODpQ2HCoI7gOBHYppJgzQaGICyp+SvEXSQR1ia3rAnBnT95kdROi65TdG/P8qWrWRwZkAOHoABccA5K4AZUQBVg8AiewSt4s56sF+vd+piOLlmznQPwB9bnD4Tjlrg=</latexit>

   Debemos rechazar la hipótesis H0 si q > c, el cual se determina a partir de
   un nivel de significancia:

   x1

   <latexit
   sha1_base64="3WONoTNXvdTvUGytop1DfX0hJdA=">AAACEXicbVDLSsNAFJ3UV62vqEs3g0XopiUpgm6UopsuK9gHpGmYTCft0MkkzkyEEvsLbvwVNy4UcevOnX/jtM1CWw9cOJxzL/fe48eMSmVZ30ZuZXVtfSO/Wdja3tndM/cPWjJKBCZNHLFIdHwkCaOcNBVVjHRiQVDoM9L2R9dTv31PhKQRv1XjmLghGnAaUIyUljyz1EUsHiJ4ARvO3SV+SLt+AOsTz3K1ZJdJLy1XOe5VJ55ZtCrWDHCZ2BkpggwNz/zq9iOchIQrzJCUjm3Fyk2RUBQzMil0E0lihEdoQBxNOQqJdNPZRxN4opU+DCKhiys4U39PpCiUchz6ujNEaigXvan4n+ckKjh3U8rjRBGO54uChEEVwWk8sE8FwYqNNUFYUH0rxEMkEFY6xIIOwV58eZm0qhXbqtg3p8XaVRZHHhyBY1ACNjgDNVAHDdAEGDyCZ/AK3own48V4Nz7mrTkjmzkEf2B8/gDSuZsZ</latexit>

   Conclusión: se acepta H0 si (ver libro Papoulis [14], Cap. 9.3)

   x2

   x3 x4

   x5

   <latexit
   sha1_base64="MhiFY53QKsK8dW+GvpfXX6ZSMsA=">AAACE3icbVDLSsNAFJ3UV62vqEs3wSJUwZIUQVdSdOOygn1AE8rNdNIOnUzSmYlQQv7Bjb/ixoUibt2482+ctllo9cCFM+fcy9x7/JhRqWz7yygsLa+srhXXSxubW9s75u5eS0aJwKSJIxaJjg+SMMpJU1HFSCcWBEKfkbY/up767XsiJI34nZrExAthwGlAMSgt9cyT8aUrx0Klp24gAKdOltZ4xnhl/nSBxUPQWnac9cyyXbVnsP4SJydllKPRMz/dfoSTkHCFGUjZdexYeSkIRTEjWclNJIkBj2BAuppyCIn00tlNmXWklb4VREIXV9ZM/TmRQijlJPR1ZwhqKBe9qfif101UcOGllMeJIhzPPwoSZqnImgZk9akgWLGJJoAF1btaeAg6DKVjLOkQnMWT/5JWrerYVef2rFy/yuMoogN0iCrIQeeojm5QAzURRg/oCb2gV+PReDbejPd5a8HIZ/bRLxgf37OXnqk=</latexit>





** Tests empíricos: Test Espectral

   17

   Consiste en graficar secuencias de 2, 3 o más números consecutivos generados
   y detectar si existe algún patrón. Números realmente aleatorios no deberían
   exhibir ningún patrón.

   By Skylord, CC BY-SA 4.0,
   https://commons.wikimedia.org/w/index.php?curid=53864518

   En 3 dimensiones: Ejemplo IBM’s RANDU

   Xn+1 = (65539Xn )

   mod 231

   <latexit
   sha1_base64="fAbfraIrdLwdTXJntyCjUdE6ei8=">AAACCXicbVDLSgMxFM34rPU16tJNsAgVoUxa62MhFN24rGAf0I5DJk3b0ExmSDJCGbp146+4caGIW//AnX9j2s5CWw9cOJxzL/fe40ecKe0439bC4tLyympmLbu+sbm1be/s1lUYS0JrJOShbPpYUc4ErWmmOW1GkuLA57ThD67HfuOBSsVCcaeHEXUD3BOsywjWRvJs2PQScYxG8BLmT8vl0kXTE0ewHYQdWLxPSmjk2Tmn4EwA5wlKSQ6kqHr2V7sTkjigQhOOlWohJ9JugqVmhNNRth0rGmEywD3aMlTggCo3mXwygodG6cBuKE0JDSfq74kEB0oNA990Blj31aw3Fv/zWrHunrsJE1GsqSDTRd2YQx3CcSywwyQlmg8NwUQycyskfSwx0Sa8rAkBzb48T+rFAnIK6PYkV7lK48iAfXAA8gCBM1ABN6AKaoCAR/AMXsGb9WS9WO/Wx7R1wUpn9sAfWJ8/uF+XKw==</latexit>

   Luis Sanchez https://commons.wikimedia.org/w/index.php?curid=3832343





** Test Visual (Espectral)

   18

   ZOOM eje x





** Tests empíricos: Otros tests
   (se verán en la práctica)

   19

   - Test Serial: En una secuencia de números al azar busca comprobar que
   los pares de números consecutivos estén distribuidos uniformemente.
   - Run Test: Este test permite detectar secuencias monótonas de números
   al azar.
   - Gap Test: Siendo Ui un número aleatorio con distribución uniforme en un
   rango [0,1] y 0<=α < β <= 1. Este test consiste en contar la cantidad de
   números aleatorios generados de forma consecutiva entre la generación de un
   número que pertenece al intervalo [α,β] y el próximo número generado que
   vuelve a pertenecer al intervalo.

* Material de Lectura
  Libros (mínimo): [15] Probability, Statistics, and Random Processes for
  Eletrical Engineerging, 3rd_Ed. - Leon-Garcia. Caps. 2-3, 8.7.  [4] Numerical
  Computing with Matlab - Cleve Moller. Cap. 9 (Pags. 282 - 295).

  Libros (opcional): [3] The Art of Computing Programming 3rd Ed 1997 -
  D. E. Knuth. Caps. 3.1, 3.2 y 3.3.  [14]
  Papoulis-probability-random-variables-and-stochastic-processes. Caps. 2-4.

  Papers (opcional):
  - Lewis-Goodman-Miller, A pseudo-random number generator for the System
    360, 1969. Park and Miller, Random Number Generator Good Ones are Hard to
    Find, 1988. Mersenne Twister, A 623-dimensionally equidistributed uniform
    pseudorandom number generator, 1998.

               