simulacion/03.html




<div id="outline-container-orgfba2b2c" class="outline-3">
<h3 id="orgfba2b2c"><span class="section-number-3">3.3</span> Caso continuo</h3>
<div class="outline-text-3" id="text-3-3">
<p>
16
</p>

<p>
Opción 1: dividir el espacio en K subintervalos mutuamente exclusivos y
calcular la probabilidad asociada a cada sub-intervalo (ver Ejemplo 8.36,
libro Leon-García [15] donde se aplica un test Chi2 con una distribución
exponencial usando 20 sub-intervalos).
</p>

<p>
Opción 2: Test Estadístico Kolmogorov-Smirnov
</p>

<p>
Dada n observaciones {x<sub>1</sub>, x<sub>2</sub>, &hellip;, x<sub>n</sub>} (ordenadas) de una variable
continua X, obtenemos una aproximación empírica a la función acumulativa:
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="Ycf//4GX99SVzRFpx5jZ3aFVh1U="&gt;AAACGHicbVDLSsNAFJ34rPUVdelmMAh1UxMRdCMUheKygn1AE8JkOmmHTiZhZiItIZ/hxl9x40IRt935N07bLLT1wIXDOfdy7z1BwqhUtv1trKyurW9slrbK2zu7e/vmwWFLxqnApIljFotOgCRhlJOmooqRTiIIigJG2sHwbuq3n4iQNOaPapwQL0J9TkOKkdKSb57XK6MzFyWJiEfQHSCV1XOtwBvohgLhzLXgyKfQZQSO8oznvmnZVXsGuEycgligQMM3J24vxmlEuMIMSdl17ER5GRKKYkbysptKkiA8RH3S1ZSjiEgvmz2Ww1Ot9GAYC11cwZn6eyJDkZTjKNCdEVIDuehNxf+8bqrCay+jPEkV4Xi+KEwZVDGcpgR7VBCs2FgThAXVt0I8QDoQpbMs6xCcxZeXSeui6thV5+HSqt0WcZTAMTgBFeCAK1AD96ABmgCDZ/AK3sGH8WK8GZ/G17x1xShmjsAfGJMfks+e3Q==&lt;/latexit&gt;
</p>

<p>
Método: medimos la distancia a la distribución real: &lt;latexit
sha1<sub>base64</sub>="vx21Sm94RHFF2TrK9UqcprJU+5M="&gt;AAACBHicbVDLSgMxFM34rPU16rKbYBHqwjIjgm6EolBcVrAPaIchk2ba0CQzJhlpmXbhxl9x40IRt36EO//G9LHQ1gP3cjjnXpJ7gphRpR3n21paXlldW89sZDe3tnd27b39mooSiUkVRyySjQApwqggVU01I41YEsQDRupB73rs1x+IVDQSd3oQE4+jjqAhxUgbybdz9/ASctT3+3DY6iKdlkeF/vFJ2bShb+edojMBXCTujOTBDBXf/mq1I5xwIjRmSKmm68TaS5HUFDMyyrYSRWKEe6hDmoYKxIny0skRI3hklDYMI2lKaDhRf2+kiCs14IGZ5Eh31bw3Fv/zmokOL7yUijjRRODpQ2HCoI7gOBHYppJgzQaGICyp+SvEXSQR1ia3rAnBnT95kdROi65TdG/P8qWrWRwZkAOHoABccA5K4AZUQBVg8AiewSt4s56sF+vd+piOLlmznQPwB9bnD4Tjlrg=&lt;/latexit&gt;
</p>

<p>
Debemos rechazar la hipótesis H0 si q &gt; c, el cual se determina a partir de
un nivel de significancia:
</p>

<p>
x1
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="3WONoTNXvdTvUGytop1DfX0hJdA="&gt;AAACEXicbVDLSsNAFJ3UV62vqEs3g0XopiUpgm6UopsuK9gHpGmYTCft0MkkzkyEEvsLbvwVNy4UcevOnX/jtM1CWw9cOJxzL/fe48eMSmVZ30ZuZXVtfSO/Wdja3tndM/cPWjJKBCZNHLFIdHwkCaOcNBVVjHRiQVDoM9L2R9dTv31PhKQRv1XjmLghGnAaUIyUljyz1EUsHiJ4ARvO3SV+SLt+AOsTz3K1ZJdJLy1XOe5VJ55ZtCrWDHCZ2BkpggwNz/zq9iOchIQrzJCUjm3Fyk2RUBQzMil0E0lihEdoQBxNOQqJdNPZRxN4opU+DCKhiys4U39PpCiUchz6ujNEaigXvan4n+ckKjh3U8rjRBGO54uChEEVwWk8sE8FwYqNNUFYUH0rxEMkEFY6xIIOwV58eZm0qhXbqtg3p8XaVRZHHhyBY1ACNjgDNVAHDdAEGDyCZ/AK3own48V4Nz7mrTkjmzkEf2B8/gDSuZsZ&lt;/latexit&gt;
</p>

<p>
Conclusión: se acepta H0 si (ver libro Papoulis [14], Cap. 9.3)
</p>

<p>
x2
</p>

<p>
x3 x4
</p>

<p>
x5
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="MhiFY53QKsK8dW+GvpfXX6ZSMsA="&gt;AAACE3icbVDLSsNAFJ3UV62vqEs3wSJUwZIUQVdSdOOygn1AE8rNdNIOnUzSmYlQQv7Bjb/ixoUibt2482+ctllo9cCFM+fcy9x7/JhRqWz7yygsLa+srhXXSxubW9s75u5eS0aJwKSJIxaJjg+SMMpJU1HFSCcWBEKfkbY/up767XsiJI34nZrExAthwGlAMSgt9cyT8aUrx0Klp24gAKdOltZ4xnhl/nSBxUPQWnac9cyyXbVnsP4SJydllKPRMz/dfoSTkHCFGUjZdexYeSkIRTEjWclNJIkBj2BAuppyCIn00tlNmXWklb4VREIXV9ZM/TmRQijlJPR1ZwhqKBe9qfif101UcOGllMeJIhzPPwoSZqnImgZk9akgWLGJJoAF1btaeAg6DKVjLOkQnMWT/5JWrerYVef2rFy/yuMoogN0iCrIQeeojm5QAzURRg/oCb2gV+PReDbejPd5a8HIZ/bRLxgf37OXnqk=&lt;/latexit&gt;
</p>
</div>
</div>





<div id="outline-container-org2028645" class="outline-3">
<h3 id="org2028645"><span class="section-number-3">3.4</span> Tests empíricos: Test Espectral</h3>
<div class="outline-text-3" id="text-3-4">
<p>
17
</p>

<p>
Consiste en graficar secuencias de 2, 3 o más números consecutivos generados
y detectar si existe algún patrón. Números realmente aleatorios no deberían
exhibir ningún patrón.
</p>

<p>
By Skylord, CC BY-SA 4.0,
<a href="https://commons.wikimedia.org/w/index.php?curid=53864518">https://commons.wikimedia.org/w/index.php?curid=53864518</a>
</p>

<p>
En 3 dimensiones: Ejemplo IBM’s RANDU
</p>

<p>
Xn+1 = (65539Xn )
</p>

<p>
mod 231
</p>

<p>
&lt;latexit
sha1<sub>base64</sub>="fAbfraIrdLwdTXJntyCjUdE6ei8="&gt;AAACCXicbVDLSgMxFM34rPU16tJNsAgVoUxa62MhFN24rGAf0I5DJk3b0ExmSDJCGbp146+4caGIW//AnX9j2s5CWw9cOJxzL/fe40ecKe0439bC4tLyympmLbu+sbm1be/s1lUYS0JrJOShbPpYUc4ErWmmOW1GkuLA57ThD67HfuOBSsVCcaeHEXUD3BOsywjWRvJs2PQScYxG8BLmT8vl0kXTE0ewHYQdWLxPSmjk2Tmn4EwA5wlKSQ6kqHr2V7sTkjigQhOOlWohJ9JugqVmhNNRth0rGmEywD3aMlTggCo3mXwygodG6cBuKE0JDSfq74kEB0oNA990Blj31aw3Fv/zWrHunrsJE1GsqSDTRd2YQx3CcSywwyQlmg8NwUQycyskfSwx0Sa8rAkBzb48T+rFAnIK6PYkV7lK48iAfXAA8gCBM1ABN6AKaoCAR/AMXsGb9WS9WO/Wx7R1wUpn9sAfWJ8/uF+XKw==&lt;/latexit&gt;
</p>

<p>
Luis Sanchez <a href="https://commons.wikimedia.org/w/index.php?curid=3832343">https://commons.wikimedia.org/w/index.php?curid=3832343</a>
</p>
</div>
</div>





<div id="outline-container-orgd9ee7e7" class="outline-3">
<h3 id="orgd9ee7e7"><span class="section-number-3">3.5</span> Test Visual (Espectral)</h3>
<div class="outline-text-3" id="text-3-5">
<p>
18
</p>

<p>
ZOOM eje x
</p>
</div>
</div>





<div id="outline-container-org4f636e7" class="outline-3">
<h3 id="org4f636e7"><span class="section-number-3">3.6</span> Tests empíricos: Otros tests</h3>
<div class="outline-text-3" id="text-3-6">
<p>
(se verán en la práctica)
</p>

<p>
19
</p>

<ul class="org-ul">
<li>Test Serial: En una secuencia de números al azar busca comprobar que</li>
</ul>
<p>
los pares de números consecutivos estén distribuidos uniformemente.
</p>
<ul class="org-ul">
<li>Run Test: Este test permite detectar secuencias monótonas de números</li>
</ul>
<p>
al azar.
</p>
<ul class="org-ul">
<li>Gap Test: Siendo Ui un número aleatorio con distribución uniforme en un</li>
</ul>
<p>
rango [0,1] y 0&lt;=α &lt; β &lt;= 1. Este test consiste en contar la cantidad de
números aleatorios generados de forma consecutiva entre la generación de un
número que pertenece al intervalo [α,β] y el próximo número generado que
vuelve a pertenecer al intervalo.
</p>
</div>
</div>
</div>

<div id="outline-container-org5ad266d" class="outline-2">
<h2 id="org5ad266d"><span class="section-number-2">4</span> Material de Lectura</h2>
<div class="outline-text-2" id="text-4">
<p>
Libros (mínimo): [15] Probability, Statistics, and Random Processes for
Eletrical Engineerging, 3rd<sub>Ed</sub>. - Leon-Garcia. Caps. 2-3, 8.7.  [4] Numerical
Computing with Matlab - Cleve Moller. Cap. 9 (Pags. 282 - 295).
</p>

<p>
Libros (opcional): [3] The Art of Computing Programming 3rd Ed 1997 -
D. E. Knuth. Caps. 3.1, 3.2 y 3.3.  [14]
Papoulis-probability-random-variables-and-stochastic-processes. Caps. 2-4.
</p>

<p>
Papers (opcional):
</p>
<ul class="org-ul">
<li>Lewis-Goodman-Miller, A pseudo-random number generator for the System
360, 1969. Park and Miller, Random Number Generator Good Ones are Hard to
Find, 1988. Mersenne Twister, A 623-dimensionally equidistributed uniform
pseudorandom number generator, 1998.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 2020-09-16 12:51
</div>
</body>
</html>
